tylertms/dspic33e-sim/tests/device/rtcc_test.c
static void interrupt_output_power_cases(TestState* state, Dspic33* cpu) {
    uint8_t priority;
    bool high;
    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "raise enabled RTCC interrupt");
    expect(state, interrupt_flag(cpu) && !dspic33_device_wake(cpu),
           "RTCCIF sets with IEC disabled and cannot wake");
    configure_interrupt(cpu, 3u);
    expect(state, dspic33_device_service_interrupt(cpu), "service RTCC interrupt");
    expect(state, cpu->last_interrupt == RTCC_IRQ && cpu->pc == RTCC_VECTOR,
           "RTCC interrupt uses IRQ62 vector");

    dspic33_reset(cpu, 0u);
    configure_interrupt(cpu, 3u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, !dspic33_device_wake(cpu), "RTCC IEC without RTCCIF cannot wake");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 0u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, !dspic33_device_wake(cpu), "priority-zero RTCC alarm cannot wake");

    for (priority = 1u; priority <= 2u; priority++) {
        uint32_t pc;
        uint16_t stack;
        dspic33_reset(cpu, 0u);
        enable_clock(cpu);
        configure_interrupt(cpu, priority);
        cpu->sr = 0x0040u;
        cpu->power_state = DSPIC33_POWER_SLEEP;
        set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
        dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
        clock_edges(cpu, 16384u);
        pc = cpu->pc;
        stack = cpu->w[15];
        expect(state,
               dspic33_device_wake(cpu) && cpu->pc == pc && cpu->w[15] == stack &&
                   cpu->interrupt_count == 0u && interrupt_flag(cpu),
               "low-or-equal RTCC alarm wakes without interrupt frame");
        cpu->sr = 0u;
        expect(state,
               dspic33_device_service_interrupt(cpu) && cpu->last_interrupt == RTCC_IRQ &&
                   cpu->interrupt_count == 1u,
               "retained RTCCIF vectors after lowering IPL");
    }

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 2u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    dspic33_write_word(cpu, 0x0820u, 0x0002u);
    dspic33_write_word(cpu, 0x0840u, 0x0040u);
    dspic33_write_word(cpu, 0x0800u, 0x0002u);
    expect(state,
           dspic33_device_wake(cpu) && cpu->last_interrupt == 1u && cpu->interrupt_count == 1u,
           "concurrent higher-priority IRQ wins wake vector");
    expect(state, interrupt_flag(cpu), "concurrent higher IRQ retains RTCCIF");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    dspic33_write_word(cpu, 0x08c2u, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->power_state == DSPIC33_POWER_ACTIVE &&
               cpu->interrupt_count == 0u && interrupt_flag(cpu),
           "GIE-disabled RTCC alarm wakes without vectoring");
    expect(state, cpu->last_interrupt == UINT16_MAX && cpu->w[15] == 0x1800u,
           "GIE-disabled wake leaves control state unchanged");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->disicnt = 2u;
    dspic33_load_program_word(cpu, cpu->pc, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->power_state == DSPIC33_POWER_ACTIVE &&
               cpu->interrupt_count == 0u && cpu->disicnt == 1u && interrupt_flag(cpu),
           "DISI masks RTCC vector while allowing Sleep wake");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 0u &&
               cpu->disicnt == 0u && interrupt_flag(cpu),
           "RTCCIF remains pending through final DISI cycle");
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 1u &&
               cpu->last_interrupt == RTCC_IRQ,
           "retained RTCCIF vectors after DISI expires");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 7u);
    cpu->disicnt = 2u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state,
           dspic33_step(cpu) == DSPIC33_RUNNING && cpu->interrupt_count == 1u &&
               cpu->last_interrupt == RTCC_IRQ,
           "priority-seven RTCC alarm vectors through DISI");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 2u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "raise equal-priority sleep alarm");
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "equal-priority alarm wakes processor");
    expect(state,
           cpu->power_state == DSPIC33_POWER_ACTIVE && interrupt_flag(cpu) &&
               cpu->interrupt_count == 0u && cpu->w[15] == 0x1800u,
           "equal-priority wake retains flag without interrupt frame");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->sr = 0x0040u;
    cpu->power_state = DSPIC33_POWER_SLEEP;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, dspic33_step(cpu) == DSPIC33_RUNNING, "higher-priority alarm wakes and vectors");
    expect(state,
           cpu->last_interrupt == RTCC_IRQ && cpu->interrupt_count == 1u && cpu->w[15] == 0x1804u,
           "higher-priority alarm stacks interrupt frame");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    configure_interrupt(cpu, 3u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    expect(state, clock_edges(cpu, 16384u), "advance RTCC alarm while Idle");
    expect(state,
           cpu->io.rtcc.prescaler == 16384u && interrupt_flag(cpu) &&
               dspic33_step(cpu) == DSPIC33_RUNNING && cpu->power_state == DSPIC33_POWER_ACTIVE &&
               cpu->last_interrupt == RTCC_IRQ,
           "RTCC continues in Idle and alarm wakes through vector");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) | RTCC_OUTPUT_ENABLE));
    expect(state, dspic33_rtcc_output(cpu, &high) && !high, "alarm output starts low");
    dspic33_write_word(cpu, RTCC_ALARM_CONTROL, RTCC_ALARM_ENABLE);
    clock_edges(cpu, 16384u);
    expect(state, dspic33_rtcc_output(cpu, &high) && high, "alarm event drives RTCC output");
    dspic33_write_word(cpu, RTCC_PAD_CONTROL, 0x0002u);
    expect(state, dspic33_rtcc_output(cpu, &high) && high, "RTSECSEL selects half-second output");
    clock_edges(cpu, 16384u);
    expect(state, dspic33_rtcc_output(cpu, &high) && !high, "seconds output follows HALFSEC");
    dspic33_write_word(cpu, RTCC_CONTROL,
                       (uint16_t)(dspic33_read_word(cpu, RTCC_CONTROL) & ~RTCC_OUTPUT_ENABLE));
    expect(state, !dspic33_rtcc_output(cpu, &high), "RTCOE disables logical output API");

    dspic33_reset(cpu, 0u);
    enable_clock(cpu);
    set_calendar(cpu, 0x0000u, 0x0000u, 0x0101u, 0x0000u);
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, RTCC_PMD);
    expect(state, !cpu->io.rtcc.pmd_disabled, "RTCC PMD disable is delayed");
    expect(state, dspic33_device_advance(cpu, 1u) && cpu->io.rtcc.pmd_disabled,
           "RTCC PMD disable applies after one cycle");
    expect(state, dspic33_read_word(cpu, RTCC_CONTROL) == 0u,
           "RTCC PMD reads module registers as zero");
    expect(state, clock_edges(cpu, 32768u) && cpu->io.rtcc.calendar[0] == 0u,
           "RTCC PMD blocks clock edges");
    dspic33_write_word(cpu, RTCC_PMD_ADDRESS, 0u);
    expect(state, dspic33_device_advance(cpu, 1u) && !cpu->io.rtcc.pmd_disabled,
           "RTCC PMD re-enable is delayed");
    expect(state, cpu->io.rtcc.calendar[0] == 0u, "RTCC PMD preserves calendar state");
}

